In [1]:
# List of high schools
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

In [2]:
import pandas as pd

In [4]:
school_series=pd.Series(high_schools)
school_series

0    Hernandez High School
1     Figueroa High School
2       Wilson High School
3       Wright High School
dtype: object

In [10]:
for a in high_schools:
    print(a)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [5]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

In [8]:
school_pd=pd.DataFrame(high_school_types)
school_pd

  High School      Type
0     Griffin  District
1    Figueroa  District
2      Wilson   Charter
3      Wright   Charter

In [10]:
school_id = [0, 1, 2, 3, 4]
school_id_df=pd.DataFrame(school_id)
school_id_df

   0
0  0
1  1
2  2
3  3
4  4

In [11]:
pd.Series(school_id)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [17]:
school_id = [0, 1, 2, 3, 4]
school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]
type_of_school = ["District", "District", "Charter", "District","Charter"]

schools_df = pd.DataFrame()

schools_df["School ID"]=school_id
schools_df["School Name"]=school_name
schools_df["School type"]=type_of_school
schools_df

   School ID            School Name School type
0          0      Huang High School    District
1          1   Figueroa High School    District
2          2    Shelton High School     Charter
3          3  Hernandez High School    District
4          4    Griffin High School     Charter

In [15]:
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}
pd.DataFrame(high_schools_dict)

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [19]:
schools_df.columns

Index(['School ID', 'School Name', 'School type'], dtype='object')

In [20]:
schools_df.index

RangeIndex(start=0, stop=5, step=1)

In [21]:
schools_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [27]:
schoolid=[0,1,2,3,4]
schoolname=["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]
schooltype=["District","Charter","District","Charter","District"]
school=pd.DataFrame()

In [28]:
school["School Id"]=schoolid
school["School name"]=schoolname
school["school type"]=schooltype
school

   School Id            School name school type
0          0      Huang High School    District
1          1   Figueroa High School     Charter
2          2    Shelton High School    District
3          3  Hernandez High School     Charter
4          4    Griffin High School    District